{"user_001": "Matin Maleki \n+1-647-701-5924       matin.mlk@gmail.com    Richmond hill, ON, Canada \n \n \nObjective \n \nTechnology professional with +17 Years  of experience spanning software development. Candidate PhD and graduated \nwith a Master's in Software Engineering. Skilled in various phases of the software development lifecycle (SDLC) from \nrequirement gathering , analysis, modeling,  and conceptual design  to prototyping, developing, deploying,  and \nautomating  test applications for launch. Leading and building cross-functional teams and hands-on software \ndevelopment and research for adopting new solutions and technologies in multi-tier, clean architecture , serverless \npatterns,  and microservice-based  architectures. Author of the book “ Developers Ultimate Guide: Linux Bash Scripting: \nLinux Basics to Advanced Topics and Bash Scripting in 12 Weeks ” \n \nSkills & Abilities (years of experience) \n \nModeling:  UML (12) RUP (5) Enterprise Architect (4) Papyrus (1) Lucid Charts (5) \nCore Dev : C# (17) JavaScript (10) C++ (6) Python (4) Java (2) .Net (17) REST APIs (10) Node.js (4) \nBack-End:  MS SQL (14) Azure SQL (8) Postgres (6) Timescale DB (6) MongoDB (2) \nFront-End : ASP.Net (10) MVC.Net (8) JavaScript (8) Silverlight (3) WPF (8) HTML (14) CSS (14) \nAngular JS:  (4) ReactJS (4) Bootstrap (8) jQuery (8) \nArchitecture : N-tier (14), Clean Architecture (6) Microservices (5) MVVM (7) MVC (10) \nPrototyping:  Adobe toolset (8) Figma (2) \nPlatforms : Windows (14) Linux (8) Mac (6) Android (2) iOS (2) NVIDIA Jetson (1) Raspberry PI (6) \nAzure Kinect (2) ROS (1) \nAI & Processing : OpenCV (10) TensorFlow(2) PyTorch(2) Scikit-Image (2) YOLO (2) Stable Diffusion (2) \nCloud Services:  MS Azure (6), AWS (1), Google Cloud (1) \nCI/CD and DevOps: Azure DevOps (6)  \nSource Control : Team Foundation Server (10), GitHub (10), Azure DevOps (6) \n \nExperience \n \nWOODGROVE TECHNOLOGIES TORONTO      2020 – 2024 \nSOFTWARE DEVELOPMENT TEAM LEAD / MANAGER  (2021 – 2024)  \nProjects AwaRE, PCS and POP: \n- Fuzzy Logic Control Systems: Led the design and implementation of Azure cloud architectures, emphasizing scalability, \nresilience, and alignment with modern DevOps practices. Designed and integrated fuzzy logic components to enable \nflexible decision-making under changing conditions and incomplete data. \n- Cloud & DevOps Integration: Established microservices and continuous delivery workflows. \n- Architected cloud-based solutions on Azure to enhance scalability and reliability. Architectural Governance & Best \nPractices Defined architectural standards, design patterns, and coding guidelines. \n- Microservices & Computer Vision: Built a microservices-based IP camera feature extraction framework. Developed a \nC++ computer vision module for analyzing images and videos across various stages of an industrial process. \n- Scalable Time-Series Database: Planned and implemented a specialized database solution to capture thousands of data \npoints per second. \n- Ensured smooth interaction between control systems and real-time process automation. \n- Prioritized high-speed retrieval and storage to support real-time analytics. \n- Conducted regular reviews to maintain system performance, security, and compliance. \n- Strategic Technology Planning: Researched emerging technologies and evaluated potential benefits for long-term \narchitectural evolution. Provided recommendations that balanced innovation with system stability and business needs. \n \nSENIOR SOFTWARE DEVELOPER  (2020-2021) \nProject AwaRE:  \n- Develop Real-Time System Monitoring Schematics and Time-Series Data Visualization Dashboards \n- Architect Real-Time Data Pipelines: Design and implement scalable data ingestion processes for real-time monitoring, \nensuring system resilience and fault tolerance across distributed environments. \nPage 2 - Implement Alerting & Notification Strategies: Configure triggers and alert thresholds for critical metrics, ensuring \ntimely incident response and minimizing system downtime. \n- Optimize Performance & Scalability: Evaluate and refine system performance by conducting stress tests, tuning data \npipelines, and optimizing dashboard rendering to handle large-scale traffic and data volume. \n- Design Interactive Dashboards: Develop intuitive, user-focused dashboards for time-series data, leveraging modern UI \nframeworks and analytics tools to present complex metrics in an actionable format. \n- Maintain Industry Best Practices: Stay current with emerging tools and technologies in real-time monitoring and data \nvisualization, and apply best practices to enhance reliability, security, and compliance. \n \n \nTechnical Environment : Postgres, Timescale DB, OPC Client App, Net Core, Clean Architecture. \n.Net Core 3.1, C#, REST APIs, Swagger Endpoints.  \n \nDAC GROUP TORONTO          2018– 2020  \nAPPLICATION DEVELOPER   \n      \nProject Swoop Cloud-Based Data Aggregation: \n- Cloud-Based Data Aggregation: Designed and developed a system to collect, process, and unify public data from \nmultiple sources in real-time. Applied a modular, cloud-native architecture to simplify data ingestion, validation, and \nenrichment. \n- Local Presence Management: Built a centralized platform to manage location-specific information (e.g., addresses, \ncontact details), ensuring accurate, up-to-date records for each locale. \n- Integrated geolocation services and mapping APIs to automatically update and verify location data. \n- Database Migration to Distributed Azure SQL: Transitioned from a single, centralized MongoDB instance to a \ndistributed Azure SQL Database architecture. Achieved higher performance and reliability by leveraging sharding, \nreplication, and built-in Azure services for fault tolerance. \nImplemented strategies to handle schema migrations, data consistency, and concurrency during the transition. \n- Scalable & Secure Implementation: Employed microservices and containerization for flexible deployment and easier \nmaintenance. Established CI/CD pipelines with Azure DevOps to automate builds, testing, and releases.  Incorporated \nAzure security best practices (Azure AD, role-based access control, encryption at rest) to safeguard sensitive data. \n- Performance Monitoring & Optimization: Utilized Azure Monitor and Application Insights for logging, real-time \nmetrics, and alerts, enabling proactive troubleshooting. \nFine-tuned queries and indexing strategies in Azure SQL to improve read/write throughput and reduce latency. \n- Business Impact: Enabled faster access to accurate local presence data, driving better customer experiences and higher \noperational efficiency. Positioned the organization for future expansion through a robust, cloud-native architecture \nthat scales on demand. \n \nProject LDM: Design JSON online validation tool using microservices: \n \n- Establish validation logic for verifying data accuracy (e.g., format checks, geolocation constraints, duplicates). \n- Design workflows and pipelines to handle incoming data in real time, ensuring minimal latency. \n- Develop unit, integration, and end-to-end tests for each validation rule to ensure reliable outcomes. \n- Simulate edge cases (e.g., incomplete addresses, multiple languages) to verify the tool’s resilience and accuracy. \n \nTechnical Environment : .Net Core 3.1, Azure Service Bus, Azure Functions, C#, App Insight, REST APIs, Swagger \nEndpoints, Azure Elastic Pools, Clean Architecture.  \n \n \nTechnical Environment : .Net Core 3.1, Azure Service Bus, Azure Functions, C#, Dapper, App Insight, REST APIs, Swagger \nEndpoints, Azure Elastic Pools, Distributed Database Design. \n \nERICSSON AND CONCORDIA UNIVERSITY MAGIC LAB      2017 – 2018 \nRESEARCH ASSISTANT  \n- Filing a patent project based on 5G and Cloud services. \n- Design systems with built-in redundancy (e.g., multi-region deployments, load balancing) and establish automatic \nfailover processes to seamlessly shift traffic when a node or data center experiences issues. \n- Leverage real-time observability tools and analytics to track critical metrics, promptly detect anomalies, and notify \nthe right teams for immediate incident response—minimizing unplanned downtime. \nPage 3 - Schedule regular system checks, conduct failover drills, and maintain up-to-date disaster recovery plans to ensure \nquick restoration of services. This practice underpins five-nines availability by mitigating risks before they \nescalate. \n \n \n \nSABAIDEA.COM            2014 – 2016 \nSOFTWARE UI/UX ARCHITECT  \n \nLeading changes from the creative team to apply on the primary presentation layer of assets for Mobile, Web, and TV for \nstartup ideas. \n- Project Aparat.com : video sharing and equivalent to youtube.com in Iran. Ranked 2 (after Google) in Iran based on \nAlexa ranking for user traffic. \n- Project Aparat Kids : cartoons and video sharing specifically designed for kids. \n- Project Aparat.com/Ojoobeha : Got talent based on uploading videos to the Aparat website. \n- Project Lenzor.com :  Leading preparation of an iPhone photo-sharing platform. \n \nTAZARV.COM            2009 – 2012 \nSOFTWARE DEVELOPER/ARCHITECT  \n \nLed changes in design and built the primary user interfaces for Windows and web applications to apply creative teams' \nideas and wrote developers architectural documents to construct the whole Tazarv BPM suite as a Business Process \nManagement System (BPMS). \n \n- Form Designer and Workflow Generator: WPF Windows-based application to create drag and drop user-generated \nforms. \n- Task Manager: Design architecture of Silverlight modular web application to manage forms in the processes. \n \nTechnical Environment : Silverlight, WPF, WCF, MSSQL, RIA Services, MVVM, and n-tier architecture. ( Exhibition demo link \nhttps://vimeo.com/58024978  ) \n \n \nPAYVAND SOFTWARE GROUP          2006 - 2009 \nWEB DEVELOPER  \n \nProjects:     Geo ALBA  – Geoscience information data website for ALBA group \nGeo DMS  – Geoscience digitalization and modeling system. \nId-Ir – Science and industry magazine website. \nEco Geo Databases  – Eco Group Geo science database website \nNGDIR – National Geoscience Database of Iran. \nPayvand Group  – Payvand Software Group \nGeo Journal  – Magazine \nTechnical Environment : Classic ASP, ASP.Net, MVC, MSSQL, N-tier architecture, Team Foundation Server. \n \n \nOther Project  \n \n- Project Jaaneman.ir : Leading and budget management to deliver a Healthcare personal system on mobile phones. \nTechnical Environment : ASP.Net, C#, Html5, jQuery, Android App, TFS.  \n \n- Project UniChess.ir : Leading and budget management of a game project to hold a chess competition. \nTechnical Environment : MVC.Net, C#, jQuery, Bootstrap, Rest APIs, SignalR, MS SQL, TFS.  \nProject Shahmat.ir : Founder of a Startup online web chess game with the possibility to keep the history of all \ngames of the user for further review.  \nTechnical Environment : WCF, C#, Silverlight, MSSQL, Xaml.  \n \nPage 4 - Project mbaco.ir : Led team and budget to build a web application for dynamic measurements, and managed an \nautomated monthly report on industrial water treatment of petrochemical plants. \nTechnical Environment: MVC.Net, C#, jQuery, Bootstrap, Rest APIs.  \n \n- Project elmifarhangi.ir  : Development of dynamic website management for the book publishers. \nTechnical Environment: ASP.Net, C#, blogengine.Net, Html, CSS.  \n \n- Project 4thOperator  : Windows mobile application to track, record, and report contractors in the municipality of \nAhwaz city. \nTechnical Environment : Windows Phone 6, C#, Xaml, Bootstrap, Rest APIs.  \n \n \nTeaching Experience \n \n· Seneca College | 2022 Fall - ULI 101 (70 Students) \n· Seneca College | 2023 Winter – Web322 (70 Students) \n· Seneca College | 2023 Fall – Web524 (35 students) \n· Seneca College | 2024 Winter – Web524 (35 students) \n· Seneca College | 2024 Fall – SFT and APS (150 students) \n \nTeaching Assistant bachelor’s degree Students with Dr. Saeed Shiry Ghidary  – 2010-11: \n· Programming Languages in C  \n· Advanced Programming Language in C# \n \nTeaching Assistant bachelor’s degree Students with Dr. Mahdi Pakdaman  - 2011: \n· Artificial Intelligence Course \n \nEducation \n \nDOCTOR OF PHILOSOPHY | 2017-2018 | CONCORDIA, MONTREAL, CANADA \n· Major: Electrical and Computer Engineering \n· Subject: Cloud Services and 5G Mobile network slices. \n· Related coursework: High available architectures for cloud services and model-driven software engineering.  \n \nMASTER OF ENGINEERING | 2017 | QAZVIN IAU, IRAN \n· Major: Software Engineering \n· Subject: Context-aware application design. \n· Related coursework: Customization and Personalization Algorithms.  \n \nBACHELOR OF ENGINEERING | 2013 | TEHRAN, IRAN \n· Major: Software Engineering \n· Subject: Fraud Detection in Online Games \n· Related coursework: Asynchronous Development and Architecture. \n \nVolunteer Works \n \nUsability Day Public Speaking in Iran Ministry of Communication and Telecom. \n“Emergence of Cargo Cult: Imitation in design and useless products” \n \nRobotic Competitions: \nHumanoid Robot Team Member International Competition Brazil 2014 \nHumanoid robot team member national competition Iran Open 2013 \nDeminer Autonomous Team Leader 2010 - AUT Cup – Ranked Top 8 \nDeminer Autonomous Team Leader 2011 - Iran Open - Ranked Top 8 \nDeminer Autonomous Team Leader 2012 - Iran Open - Ranked Top 8 \n \nPage 5 Robotics Title of Research:  \n\"Design and Constructing Autonomous Deminer Robot with Navigation and Obstacle Avoidance Algorithm Operating in \nUnknown Maze-Type Environments\" \n \nTechnical Committee of Robotic Competition : \nTechnical Committee AUTCup Deminer Manual \nTechnical Committee Iran Open 2010 - Deminer Autonomous - E Referee \nTechnical Committee Iran Open 2011 - Deminer Manual \nTechnical Committee Iran Open 2012 - Deminer Manual \n \nCertificates: \n \nMaster CIW web designer 2006. \nSQL server Implementation and Maintenance 2008. \nInteraction Design Foundation: Human-Computer Interaction 2015. \nInteraction Design Foundation: Gamification-Creating Addictive User Experiences 2015. \n \nMicrosoft Certified:  \nAzure AI Fundamentals Microsoft 2022 \n \n "}